[
  "{p1}, give {p2} a 30 Second chest massage over their clothes.",
  "{p1}, ask {p2} to give you a 30 Second chest massage over your clothes.",
  "{p1}, reach your hand inside {p2}’s shirt and massage their bare chest.",
  "{p1}, ask {p2} to reach their hand inside your shirt and massage your bare chest.",
  "{p1}, remove one article of your clothing right now.",
  "{p1}, ask {p2} to remove one article of their clothing right now.",
  "{p1}, lean {p2} against the wall and kiss their bare back slowly.",
  "{p1}, ask {p2} to lean you against the wall and kiss your bare back slowly.",
  "{p1}, slide your hand inside {p2}’s underwear for 20 Seconds.",
  "{p1}, ask {p2} to slide their hand inside your underwear for 20 Seconds.",
  "{p1}, pinch or bite {p2}’s nipple gently through their clothes.",
  "{p1}, ask {p2} to pinch or bite your nipple gently through your clothes.",
  "{p1}, slide your hand into {p2}’s bra and cup them for 30 Seconds.",
  "{p1}, ask {p2} to slide their hand into your bra and cup you for 30 Seconds.",
  "{p1}, give {p2} a lap dance while wearing only your undergarments.",
  "{p1}, ask {p2} to give you a lap dance while wearing only their undergarments.",
  "{p1}, slide your hands between {p2}’s thighs and move upward slowly.",
  "{p1}, ask {p2} to slide their hands between your thighs and move upward slowly.",
  "{p1}, guide {p2}’s hands to exactly where you want to be touched right now.",
  "{p1}, ask {p2} to guide your hands to exactly where they want to be touched.",
  "{p1}, give {p2} a passionate kiss on the lips for 30 Seconds.",
  "{p1}, ask {p2} to give you a passionate kiss on the lips for 30 Seconds.",
  "{p1}, use your tongue to trace a line from {p2}’s navel to their chest.",
  "{p1}, ask {p2} to use their tongue to trace a line from your navel to your chest.",
  "{p1}, reach your hand into {p2}’s pants and squeeze their glutes.",
  "{p1}, ask {p2} to reach their hand into your pants and squeeze your glutes.",
  "{p1}, remove {p2}’s shirt or top for them.",
  "{p1}, ask {p2} to remove your shirt or top for you.",
  "{p1}, kiss {p2}’s inner thigh, getting as high as possible.",
  "{p1}, ask {p2} to kiss your inner thigh, getting as high as possible.",
  "{p1}, use your teeth to pull down {p2}’s bra strap or underwear waistband.",
  "{p1}, ask {p2} to use their teeth to pull down your bra strap or waistband.",
  "{p1}, massage {p2}’s bare chest or boobs with oil or lotion for 1 Minute.",
  "{p1}, ask {p2} to massage your bare chest or boobs with oil or lotion.",
  "{p1}, sit on {p2}’s lap and grind against them for 30 Seconds.",
  "{p1}, ask {p2} to sit on your lap and grind against you for 30 Seconds.",
  "{p1}, lick {p2}’s nipple (bare skin) for 15 Seconds.",
  "{p1}, ask {p2} to lick your bare nipple for 15 Seconds.",
  "{p1}, slide your finger along the rim of {p2}’s underwear.",
  "{p1}, ask {p2} to slide their finger along the rim of your underwear.",
  "{p1}, whisper your dirtiest sexual fantasy in {p2}’s ear.",
  "{p1}, ask {p2} to whisper their dirtiest sexual fantasy in your ear.",
  "{p1}, give {p2} a hickey on a spot of their choosing.",
  "{p1}, ask {p2} to give you a hickey on a spot of your choosing.",
  "{p1}, let {p2} explore your body with their hands under your clothes for 1 Minute.",
  "{p1}, explore {p2}’s body with your hands under their clothes for 1 Minute.",
  "{p1}, take off {p2}’s socks using only your teeth.",
  "{p1}, ask {p2} to take off your socks using only their teeth.",
  "{p1}, kiss every inch of {p2}’s bare stomach.",
  "{p1}, ask {p2} to kiss every inch of your bare stomach.",
  "{p1}, reach into {p2}’s underwear and touch their bare skin in the front.",
  "{p1}, ask {p2} to reach into your underwear and touch your bare skin in the front.",
  "{p1}, bite {p2}’s inner thigh gently.",
  "{p1}, ask {p2} to bite your inner thigh gently.",
  "{p1}, pull {p2} onto the bed/couch and pin their hands above their head.",
  "{p1}, ask {p2} to pull you onto the bed/couch and pin your hands above your head.",
  "{p1}, use your tongue to explore {p2}’s ear and neck deeply.",
  "{p1}, ask {p2} to use their tongue to explore your ear and neck deeply.",
  "{p1}, remove your pants/skirt and stay in your underwear.",
  "{p1}, ask {p2} to remove their pants/skirt and stay in their underwear.",
  "{p1}, give {p2} a 30 Second thigh massage, going very high up.",
  "{p1}, ask {p2} to give you a 30 Second thigh massage, going very high up.",
  "{p1}, use your lips to find {p2}’s most sensitive spot and kiss it.",
  "{p1}, ask {p2} to find your most sensitive spot and kiss it.",
  "{p1}, slide your hand between {p2}’s legs and keep it there for the next round.",
  "{p1}, ask {p2} to slide their hand between your legs and keep it there for the next round.",
  "{p1}, blindfold {p2} and use your hands to touch them anywhere.",
  "{p1}, ask {p2} to blindfold you and use their hands to touch you anywhere.",
  "{p1}, trace {p2}’s underwear line with your tongue.",
  "{p1}, ask {p2} to trace your underwear line with their tongue.",
  "{p1}, massage {p2}’s glutes with both hands under their clothes.",
  "{p1}, ask {p2} to massage your glutes with both hands under your clothes.",
  "{p1}, kiss {p2} from their neck all the way down to their waist.",
  "{p1}, ask {p2} to kiss you from your neck all the way down to your waist.",
  "{p1}, pull {p2}’s hair gently while you kiss them passionately.",
  "{p1}, ask {p2} to pull your hair gently while they kiss you passionately. ",
  "{p1}, reach inside {p2}’s top and pinch their nipples.",
  "{p1}, ask {p2} to reach inside your top and pinch your nipples.",
  "{p1}, straddle {p2} and whisper what you want to do to them.",
  "{p1}, ask {p2} to straddle you and whisper what they want to do to you.",
  "{p1}, use your fingernails to scratch {p2}’s inner thighs.",
  "{p1}, ask {p2} to use their fingernails to scratch your inner thighs.",
  "{p1}, remove {p2}’s bra or underwear (if applicable).",
  "{p1}, ask {p2} to remove your bra or underwear.",
  "{p1}, lick a trail of water or alcohol off {p2}’s chest.",
  "{p1}, ask {p2} to lick a trail of water or alcohol off your chest.",
  "{p1}, slide your hand flat against {p2}’s bare stomach and move it down.",
  "{p1}, ask {p2} to slide their hand flat against your bare stomach and move it down.",
  "{p1}, give {p2} a french kiss for a full Minute.",
  "{p1}, ask {p2} to give you a french kiss for a full Minute.",
  "{p1}, use your lips to explore {p2}’s hip bones.",
  "{p1}, ask {p2} to use their lips to explore your hip bones.",
  "{p1}, slide your hand into {p2}’s back pocket and squeeze.",
  "{p1}, ask {p2} to slide their hand into your back pocket and squeeze.",
  "{p1}, take off your shirt and let {p2} touch your bare back.",
  "{p1}, ask {p2} to take off their shirt and let you touch their bare back.",
  "{p1}, nibble on {p2}’s neck until you leave a red mark.",
  "{p1}, ask {p2} to nibble on your neck until they leave a red mark.",
  "{p1}, slide your hands inside {p2}’s shirt and find their nipples.",
  "{p1}, ask {p2} to slide their hands inside your shirt and find your nipples.",
  "{p1}, give {p2} a 30 Second erotic massage on their lower back.",
  "{p1}, ask {p2} to give you a 30 Second erotic massage on your lower back.",
  "{p1}, use your tongue to circle {p2}’s navel.",
  "{p1}, ask {p2} to use their tongue to circle your navel.",
  "{p1}, straddle {p2} and kiss them while they hold your waist.",
  "{p1}, ask {p2} to straddle you and kiss you while you hold their waist.",
  "{p1}, slide your hand between {p2}’s thighs and squeeze gently.",
  "{p1}, ask {p2} to slide their hand between your thighs and squeeze gently.",
  "{p1}, remove one piece of {p2}’s clothing of your choice.",
  "{p1}, ask {p2} to remove one piece of your clothing of their choice.",
  "{p1}, lick {p2}’s earlobe and then whisper a dirty word.",
  "{p1}, ask {p2} to lick your earlobe and whisper a dirty word.",
  "{p1}, reach into {p2}’s pants and touch their bare skin for 30 Seconds.",
  "{p1}, ask {p2} to reach into your pants and touch your bare skin for 30 Seconds.",
  "{p1}, kiss the very top of {p2}’s inner thigh.",
  "{p1}, ask {p2} to kiss the very top of your inner thigh.",
  "{p1}, give {p2} a 1 Minute massage using your bare chest.",
  "{p1}, ask {p2} to give you a 1 Minute massage using their bare chest.",
  "{p1}, trace {p2}’s lips with your tongue and then kiss them deeply.",
  "{p1}, ask {p2} to trace your lips with their tongue and kiss you deeply.",
  "{p1}, slide your hand into {p2}’s underwear and leave it there.",
  "{p1}, ask {p2} to slide their hand into your underwear and leave it there.",
  "{p1}, bite {p2}’s bottom lip gently while kissing.",
  "{p1}, ask {p2} to bite your bottom lip gently while kissing.",
  "{p1}, remove your bra/undershirt in front of {p2}.",
  "{p1}, ask {p2} to remove their bra/undershirt in front of you.",
  "{p1}, use your fingernails to trace {p2}’s chest and stomach.",
  "{p1}, ask {p2} to use their fingernails to trace your chest and stomach.",
  "{p1}, give {p2} a 30 Second lap grind in just your underwear.",
  "{p1}, ask {p2} to give you a 30 Second lap grind in just their underwear.",
  "{p1}, kiss {p2}’s bare shoulder and move down to their breast/chest.",
  "{p1}, ask {p2} to kiss your bare shoulder and move down to your breast/chest.",
  "{p1}, slide your hand into {p2}’s pants from the back.",
  "{p1}, ask {p2} to slide their hand into your pants from the back.",
  "{p1}, lick {p2}’s neck from the collarbone to the ear.",
  "{p1}, ask {p2} to lick your neck from the collarbone to the ear.",
  "{p1}, reach inside {p2}’s underwear and describe what you feel.",
  "{p1}, ask {p2} to reach inside your underwear and describe what they feel.",
  "{p1}, pinch {p2}’s glutes firmly and then kiss them.",
  "{p1}, ask {p2} to pinch your glutes firmly and then kiss you.",
  "{p1}, use your tongue to explore {p2}’s palm and fingers.",
  "{p1}, ask {p2} to use their tongue to explore your palm and fingers.",
  "{p1}, remove {p2}’s pants or skirt for them.",
  "{p1}, ask {p2} to remove your pants or skirt for you.",
  "{p1}, kiss {p2}’s stomach and move your lips toward their underwear.",
  "{p1}, ask {p2} to kiss your stomach and move their lips toward your underwear.",
  "{p1}, slide your hand into {p2}’s bra and pinch a nipple.",
  "{p1}, ask {p2} to slide their hand into your bra and pinch a nipple.",
  "{p1}, give {p2} a 30 Second erotic neck massage.",
  "{p1}, ask {p2} to give you a 30 Second erotic neck massage.",
  "{p1}, use your lips to explore {p2}’s bare lower back.",
  "{p1}, ask {p2} to use their lips to explore your bare lower back.",
  "{p1}, slide your hand between {p2}’s thighs and rub for 20 Seconds.",
  "{p1}, ask {p2} to slide their hand between your thighs and rub for 20 Seconds.",
  "{p1}, take off {p2}’s shirt and kiss their bare chest.",
  "{p1}, ask {p2} to take off your shirt and kiss your bare chest.",
  "{p1}, lick {p2}’s collarbone and then bite it gently.",
  "{p1}, ask {p2} to lick your collarbone and then bite it gently.",
  "{p1}, reach into {p2}’s underwear and stay there for 30 Seconds.",
  "{p1}, ask {p2} to reach into your underwear and stay there for 30 Seconds.",
  "{p1}, kiss {p2}’s thigh and move upward toward their crotch.",
  "{p1}, ask {p2} to kiss your thigh and move upward toward your crotch.",
  "{p1}, give {p2} a 1 Minute massage on their bare glutes.",
  "{p1}, ask {p2} to give you a 1 Minute massage on your bare glutes.",
  "{p1}, use your tongue to explore {p2}’s lips before kissing.",
  "{p1}, ask {p2} to use their tongue to explore your lips before kissing.",
  "{p1}, remove {p2}’s belt or shoes with your teeth.",
  "{p1}, ask {p2} to remove your belt or shoes with their teeth.",
  "{p1}, slide your hand flat against {p2}’s chest under their shirt.",
  "{p1}, ask {p2} to slide their hand flat against your chest under your shirt.",
  "{p1}, kiss {p2}’s neck and then whisper what you want to do.",
  "{p1}, ask {p2} to kiss your neck and whisper what they want to do.",
  "{p1}, reach into {p2}’s bra/shirt and play with their nipples.",
  "{p1}, ask {p2} to reach into your bra/shirt and play with your nipples.",
  "{p1}, give {p2} a wet kiss on their bare stomach.",
  "{p1}, ask {p2} to give you a wet kiss on your bare stomach.",
  "{p1}, slide your hand into {p2}’s underwear and squeeze.",
  "{p1}, ask {p2} to slide their hand into your underwear and squeeze.",
  "{p1}, lick {p2}’s shoulder and then kiss it.",
  "{p1}, ask {p2} to lick your shoulder and then kiss it.",
  "{p1}, remove your socks and one other item of clothing.",
  "{p1}, ask {p2} to remove their socks and one other item of clothing.",
  "{p1}, kiss {p2}’s inner thigh three times.",
  "{p1}, ask {p2} to kiss your inner thigh three times.",
  "{p1}, reach inside {p2}’s pants and find their most sensitive spot.",
  "{p1}, ask {p2} to reach inside your pants and find your most sensitive spot.",
  "{p1}, give {p2} a 30 Second chest massage with your lips.",
  "{p1}, ask {p2} to give you a 30 Second chest massage with their lips.",
  "{p1}, use your fingernails to scratch {p2}’s bare back.",
  "{p1}, ask {p2} to use their fingernails to scratch your bare back.",
  "{p1}, straddle {p2} and kiss their neck for 1 Minute.",
  "{p1}, ask {p2} to straddle you and kiss your neck for 1 Minute.",
  "{p1}, slide your hand inside {p2}’s underwear and rub their skin.",
  "{p1}, ask {p2} to slide their hand inside your underwear and rub your skin.",
  "{p1}, kiss {p2}’s stomach and move your tongue down.",
  "{p1}, ask {p2} to kiss your stomach and move their tongue down.",
  "{p1}, remove {p2}’s top and leave them in their bra/bare.",
  "{p1}, ask {p2} to remove your top and leave you in your bra/bare.",
  "{p1}, lick {p2}’s chest and then blow on it.",
  "{p1}, ask {p2} to lick your chest and then blow on it.",
  "{p1}, reach into {p2}’s pants and leave your hand there for 1 Minute.",
  "{p1}, ask {p2} to reach into your pants and leave their hand there for 1 Minute.",
  "{p1}, give {p2} a passionate 30 Second kiss while holding their glutes.",
  "{p1}, ask {p2} to give you a passionate 30 Second kiss while holding your glutes.",
  "{p1}, use your lips to explore {p2}’s inner thighs.",
  "{p1}, ask {p2} to use their lips to explore your inner thighs.",
  "{p1}, slide your hand between {p2}’s thighs and massage.",
  "{p1}, ask {p2} to slide their hand between your thighs and massage. ",
  "{p1}, take off your shirt and let {p2} kiss your chest.",
  "{p1}, ask {p2} to take off their shirt and let you kiss their chest.",
  "{p1}, lick {p2}’s nipple through their shirt.",
  "{p1}, ask {p2} to lick your nipple through your shirt.",
  "{p1}, reach into {p2}’s underwear and pinch their skin gently.",
  "{p1}, ask {p2} to reach into your underwear and pinch your skin gently.",
  "{p1}, kiss {p2}’s neck and move toward their ear.",
  "{p1}, ask {p2} to kiss your neck and move toward your ear.",
  "{p1}, give {p2} a 30 Second erotic thigh massage.",
  "{p1}, ask {p2} to give you a 30 Second erotic thigh massage.",
  "{p1}, use your tongue to trace {p2}’s jawline.",
  "{p1}, ask {p2} to use their tongue to trace your jawline.",
  "{p1}, straddle {p2} and let them touch you anywhere.",
  "{p1}, ask {p2} to straddle you and let you touch them anywhere.",
  "{p1}, slide your hand into {p2}’s bra and rub.",
  "{p1}, ask {p2} to slide their hand into your bra and rub.",
  "{p1}, remove {p2}’s socks and kiss their feet.",
  "{p1}, ask {p2} to remove your socks and kiss your feet.",
  "{p1}, lick {p2}’s stomach and move toward their crotch.",
  "{p1}, ask {p2} to lick your stomach and move toward your crotch.",
  "{p1}, reach into {p2}’s pants and touch their bare skin.",
  "{p1}, ask {p2} to reach into your pants and touch your bare skin.",
  "{p1}, kiss {p2}’s back from top to bottom.",
  "{p1}, ask {p2} to kiss your back from top to bottom.",
  "{p1}, give {p2} a 30 Second massage on their bare stomach.",
  "{p1}, ask {p2} to give you a 30 Second massage on your bare stomach.",
  "{p1}, use your lips to explore {p2}’s armpits.",
  "{p1}, ask {p2} to use their lips to explore your armpits.",
  "{p1}, slide your hand into {p2}’s underwear and massage.",
  "{p1}, ask {p2} to slide their hand into your underwear and massage.",
  "{p1}, take off your pants and stay in your underwear.",
  "{p1}, ask {p2} to take off their pants and stay in their underwear.",
  "{p1}, lick {p2}’s chest and move toward their neck.",
  "{p1}, ask {p2} to lick your chest and move toward your neck.",
  "{p1}, reach into {p2}’s bra/shirt and squeeze.",
  "{p1}, ask {p2} to reach into your bra/shirt and squeeze.",
  "{p1}, kiss {p2}’s inner thigh and leave a mark.",
  "{p1}, ask {p2} to kiss your inner thigh and leave a mark.",
  "{p1}, give {p2} a 30 Second erotic massage on their thighs.",
  "{p1}, ask {p2} to give you a 30 Second erotic massage on your thighs.",
  "{p1}, use your tongue to explore {p2}’s neck.",
  "{p1}, ask {p2} to use their tongue to explore your neck.",
  "{p1}, straddle {p2} and kiss them deeply.",
  "{p1}, ask {p2} to straddle you and kiss you deeply.",
  "{p1}, slide your hand between {p2}’s thighs and stay there.",
  "{p1}, ask {p2} to slide their hand between your thighs and stay there.",
  "{p1}, remove {p2}’s shirt and kiss their bare back.",
  "{p1}, ask {p2} to remove your shirt and kiss your bare back.",
  "{p1}, lick {p2}’s collarbone and then kiss it.",
  "{p1}, ask {p2} to lick your collarbone and then kiss it.",
  "{p1}, reach into {p2}’s underwear and rub.",
  "{p1}, ask {p2} to reach into your underwear and rub.",
  "{p1}, kiss {p2}’s stomach and then bite it gently.",
  "{p1}, ask {p2} to kiss your stomach and bite it gently.",
  "{p1}, give {p2} a 30 Second massage on their bare glutes.",
  "{p1}, ask {p2} to give you a 30 Second massage on your bare glutes.",
  "{p1}, use your lips to explore {p2}’s chest.",
  "{p1}, ask {p2} to use their lips to explore your chest.",
  "{p1}, slide your hand into {p2}’s pants and squeeze.",
  "{p1}, ask {p2} to slide their hand into your pants and squeeze.",
  "{p1}, take off your shirt and stay bare for the next round.",
  "{p1}, ask {p2} to take off their shirt and stay bare for the next round.",
  "{p1}, what is the most sensitive part of your body that you want {p2} to touch?",
  "{p1}, have you ever had a sexual dream about {p2}?",
  "{p1}, what is your favorite sexual position to try with {p2}?",
  "{p1}, if you could have {p2} do anything to you right now, what would it be?",
  "{p1}, what is the dirtiest thing you’ve ever thought about doing to {p2}?",
  "{p1}, do you prefer being on top or bottom when with {p2}?",
  "{p1}, what kind of underwear are you wearing right now? Let {p2} see.",
  "{p1}, where is the most public place you’ve ever been intimate?",
  "{p1}, what is your biggest turn-on when it comes to {p2}’s body?",
  "{p1}, would you let {p2} record a video of you being intimate?",
  "{p1}, what is a kink you have that you haven’t told {p2} yet?",
  "{p1}, would you rather have a quickie or a long session with {p2}?",
  "{p1}, what is the first thing you noticed about {p2}’s body today?",
  "{p1}, do you prefer {p2} to be dominant or submissive?",
  "{p1}, what is the most intimate thing {p2} has ever done to you?",
  "{p1}, if {p2} were to give you a happy ending massage, where would they start?",
  "{p1}, do you like it when {p2} talks dirty to you during the game?",
  "{p1}, what is the most daring thing you want to do to {p2} tonight?",
  "{p1}, how many articles of clothing do you want to be wearing by the end of this game?",
  "{p1}, what is the best kiss you’ve ever had from {p2}?",
  "{p1}, would you like {p2} to use toys on you?",
  "{p1}, what part of {p2}’s body do you find most irresistible right now?",
  "{p1}, what is your favorite way to be woken up by {p2}?",
  "{p1}, have you ever wanted to try role-playing with {p2}?",
  "{p1}, what is the longest you’ve ever gone in one session?",
  "{p1}, would you let {p2} blindfold you and tease you for 10 minutes?",
  "{p1}, what is the naughtiest thing you’ve done in a car?",
  "{p1}, do you like it when {p2} pulls your hair or bites you?",
  "{p1}, what is a secret desire you have for {p2}?",
  "{p1}, if we stopped the game right now, what would you want to do with {p2}?"
]